Revit 2027 API
RebarUpdateCurvesData.AreWorkshopInstructionsChanged Property
 Indicates if the workshop instructions have changed since the last regeneration.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool AreWorkshopInstructionsChanged { get; }
Public ReadOnly Property AreWorkshopInstructionsChanged As Boolean
	Get
public:
property bool AreWorkshopInstructionsChanged {
	bool get ();
}
member AreWorkshopInstructionsChanged : bool with get
Property Value
Boolean
See Also
Reference
RebarUpdateCurvesData Class
Autodesk.Revit.DB.Structure Namespace